app/controllers/staffs_controller.rb

SELECT "staffs".* FROM "staffs" ORDER BY "staffs"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @staffs = Staff.all

SELECT "staffs".* FROM "staffs" WHERE (name ILIKE '%jbrand%')
---
  def search
    @query = params[:query]
    @staffs = Staff.where('name LIKE ?', "%#{@query}%")